/* В цій функції необхідно реалізувати функціонал.
 Вона має питати у юзера імʼя та записувати його кудись(накопичувати). Питатиме безліч разів, по слову стоп вона зупиняє опитування
та виводить все що накопичила в консоль.


 Вона має записувати імʼя(розділяти їх давай переносом строки) тільки у випадку якщо було введено значення, воно більше 4 включно символів,
 інакше не записуємо.
 Логіку перевірки винести у функцію, та записувати тільки capitalized значення(теж окремою функцією реалізувати)
*/

function main() {
    while (true) {
    let name = prompt('Введіть ім\'я');

    i
}













function requestAndLogNames() {
    while (true) {
        let name = prompt("Введіть ім'я:");

        if (!name) {
            break;
        }

        console.log("Введене ім'я:", name);
    }
}

// Виклик функції:
requestAndLogNames();
